app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    @movies = Movie.all

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES ('starwars', 'G', '2027-04-26', '2026-04-26 15:48:03.717855', '2026-04-26 15:48:03.717855') RETURNING "id"
---
  def create
    @movie = Movie.create!(movie_params)