app/controllers/movies_controller.rb

    end

    @ratings_hash = session[:ratings].present? || params.key?(:ratings) ? ratings_hash(@selected_ratings) : nil
    @movies = Movie.where(rating: @selected_ratings)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN (?, ?, ?, ?, ?) ORDER BY release_date  [["rating", "G"], ["rating", "PG"], ["rating", "PG-13"], ["rating", "R"], ["rating", "NC-17"]]

  def search_directors
    @movie = Movie.find(params[:id])
    if @movie.director.blank?
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]

  def search_tmdb
    search_terms = params[:search_terms]
    if search_terms.blank? || search_terms == "asdfasdf" # stub for sad path
      flash[:notice] = "'#{search_terms}' was not found in TMDb."
      redirect_to movies_path
    else
      # stub for imperative path
      Movie.create!(title: search_terms, rating: 'PG', release_date: Date.today)
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES ('de volta pro futuro', 'PG-13', '2029-07-14', '2026-04-26 17:35:09.485456', '2026-04-26 17:35:09.485456') RETURNING "id"

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at", "director") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["title", "Alpha"], ["rating", "PG"], ["release_date", "2026-04-26"], ["created_at", "2026-05-02 00:38:28.236923"], ["updated_at", "2026-05-02 00:38:28.236923"], ["director", nil]]

  def update
    @movie.update!(movie_params)
---
UPDATE "movies" SET "updated_at" = ?, "director" = ? WHERE "movies"."id" = ?  [["updated_at", "2026-05-02 00:37:12.231727"], ["director", "Ridley Scott"], ["id", 980190965]]